Carlogbu/Micros_2.0/MKL27Z64xxx4_Project/source/Practica1.c
/*
 * Copyright 2016-2018 NXP Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of NXP Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
 
/**
 * @file    MKL27Z64xxx4_Project.c
 * @brief   Application entry point.
 */
#include <stdio.h>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "MKL27Z644.h"
#include "fsl_debug_console.h"
#include "Debouncer_Driver.h"
#include "Display_Driver.h"
#include "gpio_driver.h"
#include "Process_Driver.h"

uint32_t Delay =2000;

static uint16_t control=1;
uint16_t primervalor7seg;
uint16_t segundovalor7seg;
uint16_t tercervalor7seg;
uint16_t cuartovalor7seg;

uint32_t entradaconfig;
uint32_t decrementadorcontrol;


/* TODO: insert other include files here. */

/* TODO: insert other definitions and declarations here. */

/*
 * @brief   Application entry point.
 */
int main(void) {


	while(1)
	{
		while(Delay!= 0 )
		{
			Delay --;

		}
		Delay = 2000;
		OneHot(control);

	controldepantallas(primervalor7seg,segundovalor7seg,tercervalor7seg,cuartovalor7seg);


	Samuel = vnf_DebouncerCheck5();
	Cris = vnf_DebouncerCheck6();
	Asignadordevalores();


 if (Samuel == 1)
{
	 entradaconfig =1;
	ConfigButton();
	entradaconfig = 0;

}else if (Cris ==1)
{
	decrementadorcontrol =1;

}else
{

}

}
}
